app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_current_user
    authenticate_with_http_token do |token, options|
      data = decode(token)
      data && User.find(data[:id])