app/controllers/categories_controller.rb

  def index
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.find(params[:user_id])
    @category = Category.new(category_params)
    if @category.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "categories" ("category", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "the eyes have it"], ["created_at", "2019-04-12 04:32:28.486239"], ["updated_at", "2019-04-12 04:32:28.486239"], ["user_id", 3]]

  def destroy
    @category = Category.find(params[:id])
    @user = User.find(params[:user_id])
    @category.destroy
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 21]]