app/controllers/categories_controller.rb

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 21]]