app/controllers/questions_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = $1  [["category_id", 2]]
---
  def index
    @category = Category.find(params[:category_id])
    @questions = Question.where(category_id: @category.id)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def create
    @category = Category.find(params[:category_id])