app/controllers/questions_controller.rb

  def index
    questions = current_user.question.all
---
SELECT "questions".* FROM "questions"

  def create
    question = @current_user.question.create!(question_params)
---
INSERT INTO "questions" ("question", "answer", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question", "peter pumpernickel"], ["answer", "The Be"], ["created_at", "2019-04-12 05:24:29.778367"], ["updated_at", "2019-04-12 05:24:29.778367"], ["user_id", 3], ["category_id", 15]]