app/controllers/questions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @questions = Question.where(user_id: @user.id)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = $1  [["category_id", 1]]
---
  def index_by_category
    @category = Category.find(params[:category_id])
    @questions = Question.where(category_id: @category.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "questions" ("question", "answer", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["question", "peter pumpernickel"], ["answer", "The Be"], ["created_at", "2019-04-12 05:24:29.778367"], ["updated_at", "2019-04-12 05:24:29.778367"], ["user_id", 3], ["category_id", 15]]
---
  def create
    @user = User.find(params[:user_id])
    @question = Question.new(question_params)

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:user_id])
    @question = Question.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:user_id])

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 13]]
---
  def destroy
    @question = Question.find(params[:id])
    @user = User.find(params[:user_id])
    @question.destroy