app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "total_score", "avatar_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    new_user = User.new(user_params)

    if new_user.valid?
      new_user.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mills.ma12@gmail.com"], ["LIMIT", 1]]
---
  def login
    email = params[:email]
    password = params[:password]

    user = User.find_from_credentials(email, password)

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "bob2"], ["updated_at", "2019-04-12 22:46:05.646767"], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)